MYiR-Dev/myir-imx-linux/drivers/staging/rtl8733bu/core/rtw_wnm.c
	pnb->nb_rpt_valid = _TRUE;
	ret = _SUCCESS;

exit:
	if (from_btm && pcandidate_list) {
		rtw_mfree((u8 *)pcandidate_list,
			sizeof(struct wnm_btm_cant) * RTW_MAX_NB_RPT_NUM);
	}

	return ret;
}

void rtw_wnm_process_btm_query(_adapter *padapter, u8* pframe, u32 frame_len)
{
	struct mlme_priv *pmlmepriv = &(padapter->mlmepriv);
/* for debug only */
#if 1
	u8 *ptr, *pend;
#else
	struct nb_rpt_hdr *pie;
	u8 *ptr, *pend, *op;
#endif
	u32 elem_len, subelem_len, op_len;
	u32 i, nb_rpt_entries = 0;
	if (!pframe || !frame_len)
		return;

	/* no preferred bss transition candidate list include */
	if (wnm_btm_query_reason(pframe) != 0x13)
		return;

	ptr = pframe + 4;
	elem_len = frame_len - 4;
	pend = ptr + elem_len;
	subelem_len = (u32)*(ptr + 1);

	RTW_WNM_DUMP("BTM QUERY :", ptr, elem_len);
	for (i = 0; i < RTW_MAX_NB_RPT_NUM; i++) {
		if (((ptr + 7) > pend) || (elem_len < subelem_len))
			break;
		if (*ptr != RTW_WLAN_ACTION_WNM_NB_RPT_ELEM)
			break;
#ifdef CONFIG_RTW_MBO
/* for debug only */
#if 0
		pie = (struct nb_rpt_hdr *)ptr;
		op = rtw_get_ie((u8 *)(ptr+15), WNM_BTM_CAND_PREF_SUBEID,
				&op_len, (subelem_len - 15));

		if (rtw_mbo_wifi_logo_test(padapter) &&
			check_fwstate(pmlmepriv, WIFI_AP_STATE) == _TRUE) {
			struct mbo_attr_info *pmbo_attr = \
					&(pmlmepriv->mbo_attr);
			 struct mbo_user_btm_req_pkt *puser = \
					&(pmbo_attr->user_raw);
			struct wnm_btm_cant *puser_cant;
			u8 j = 0, idx = 0, found = _FALSE;

			for (j = 0; j < RTW_MAX_NB_RPT_NUM; j++) {
				puser_cant = &puser->btm_cants[j];
				if (_rtw_memcmp(pie->bssid,
					puser_cant->nb_rpt.bssid, ETH_ALEN)) {
					puser_cant->nb_rpt.bss_info = \
						pie->bss_info;
					puser_cant->nb_rpt.reg_class = \
						pie->reg_class;
					puser_cant->nb_rpt.ch_num = \
						pie->ch_num;
					puser_cant->nb_rpt.phy_type = \
						pie->phy_type;
					puser_cant->preference = \
						*(op + 2);
					idx = j;
					found = _TRUE;
					break;
				}
			}

			if (!found) {
				if (puser->candidate_cnt >= RTW_MAX_NB_RPT_NUM)
					puser->candidate_cnt = 0;
				puser_cant = \
					&puser->btm_cants[puser->candidate_cnt];
				puser_cant->nb_rpt.id = \
					RTW_WLAN_ACTION_WNM_NB_RPT_ELEM;
				puser_cant->nb_rpt.len = 0x10;
				 _rtw_memcpy(puser_cant->nb_rpt.bssid,
					pie->bssid, ETH_ALEN);
				puser_cant->nb_rpt.bss_info = \
						pie->bss_info;
				puser_cant->nb_rpt.reg_class = \
						pie->reg_class;
				puser_cant->nb_rpt.ch_num = \
						pie->ch_num;
				puser_cant->nb_rpt.phy_type = \
						pie->phy_type;
				puser_cant->preference = \
						*(op + 2);
				puser->candidate_cnt++;
			}

			RTW_WNM_INFO("%s: idx=%u, bssid("MAC_FMT"),"
				" bss_info(0x%04X), reg_class(0x%02X),"
				" ch(%d), phy_type(0x%02X), preference(0x%02X)\n",
				__func__, (found)?idx:puser->candidate_cnt,
				MAC_ARG(puser_cant->nb_rpt.bssid),
				puser_cant->nb_rpt.bss_info,
				puser_cant->nb_rpt.reg_class,
				puser_cant->nb_rpt.ch_num,
				puser_cant->nb_rpt.phy_type,
				puser_cant->preference);
		}
#endif
#endif /* end of CONFIG_RTW_MBO */

		ptr = (u8 *)(ptr + subelem_len + 2);
		elem_len -= (subelem_len +2);
		subelem_len = *(ptr+1);
	} /* end of for-loop RTW_MAX_NB_RPT_NUM */

}

static u8 *rtw_wnm_non_pref_ch_attr_get(u8 *pie, u32 *plen, u32 limit)
{
	const u8 *p = pie;
	u32 tmp, i;

	if (limit <= 1)
		return NULL;

	i = 0;
	*plen = 0;
	while (1) {
		if ((*p == _VENDOR_SPECIFIC_IE_) &&
			(_rtw_memcmp(rtw_wnm_get_non_pref_ch_oui(p),
			wnm_non_pref_ch_oui, 4))) {
			*plen = *(p + 1);
			return (u8 *)p;
		} else {
			tmp = *(p + 1);
			p += (tmp + 2);
			i += (tmp + 2);
		}

		if (i >= limit)
			break;
	}

	return NULL;
}

void rtw_wnm_process_notification_req(
	_adapter *padapter, u8 *pframe, u32 frame_len)
{
	struct mlme_priv *pmlmepriv = &(padapter->mlmepriv);
#ifdef CONFIG_RTW_MBO
	struct mbo_attr_info *pmbo_attr = &(pmlmepriv->mbo_attr);
	struct mbo_user_btm_req_pkt *puser_raw = &(pmbo_attr->user_raw);
#endif
	struct wnm_btm_cant *pcant = NULL;
	u8 dialog, type;
	u8 *psubie;
	u8 *ptr = NULL;
	u32 left_len, subie_len;

	if (!pframe || (frame_len < 5))
		return;

	/* RTW_WNM_DUMP("notify-req :", pframe, frame_len); */
	dialog = *(pframe + 2);
	type = *(pframe + 3);

	if (type != WLAN_EID_VENDOR_SPECIFIC)
		return;

	ptr = (pframe + 4);
	left_len = (frame_len - 4);

	while((psubie = rtw_wnm_non_pref_ch_attr_get(
		ptr, &subie_len, left_len)) != NULL) {

		/* RTW_WNM_DUMP("notify-req subie :", (psubie + 2), subie_len); */

		ptr += (subie_len + 2);
		left_len -= (subie_len + 2);

#ifdef CONFIG_RTW_MBO
		if (rtw_mbo_wifi_spec_test(padapter) && \
			(subie_len > 7)) {

			u8 *pload = NULL, *pclass = NULL;
			u8 ch_nums = 0;
			u8 non_pref_ch = 0;
			u8 ch_op_pref = 1, reason = 0;
			u32 i, j;

			/* nums = sublen - oui_len -
				(class_len - op_len - reason_len) */
			ch_nums = subie_len - 4 - 3;
			if (ch_nums >= RTW_MBO_MAX_CH_LIST_NUM)
				ch_nums = RTW_MBO_MAX_CH_LIST_NUM;

			/* skip sudid, len, oui */
			pclass = (psubie + 6);
			ch_op_pref = *(pclass + ch_nums + 1);
			reason = *(pclass + ch_nums + 2);
			RTW_WNM_INFO("%s : class=0x%02x, operating=0x%02x, "
				"reason=0x%02x\n", __func__, *pclass,
				ch_op_pref, reason);

			for (i = 0; i < ch_nums; i++) {
				non_pref_ch = *(pclass + 1 + i);
				RTW_WNM_INFO("%s : non-pref ch %u "
					"found in notify-req operating 0x%02x\n",
					__func__, non_pref_ch, ch_op_pref);

				for (j = 0; j < RTW_MAX_NB_RPT_NUM; j++) {
					pcant = &puser_raw->btm_cants[j];
					if (pcant->nb_rpt.ch_num == non_pref_ch) {
						if (ch_op_pref == 0) {
							RTW_WNM_INFO("%s : reset "
							"preference(%u) for non-preference ch\n",
							__func__, pcant->preference);
							pcant->preference = 0;
						} else {
							if (!pcant->preference)
								pcant->preference = 64;
						}
					}

				} /* end of for loop RTW_MAX_NB_RPT_NUM */

			} /* end of for loop ch_nums*/

		}
#endif /* end of CONFIG_RTW_MB*/

	} /* end of while loop */

	rtw_wnm_issue_action(padapter,
		RTW_WLAN_ACTION_WNM_NOTIF_RSP, 0, dialog);

}
#endif /*defined(CONFIG_RTW_WNM) || defined(CONFIG_RTW_80211K) */

